Repository: sheilagomes/wp-trad
Catalog: tm/PHP_en-pt_BR.tmx
Source language: en
Languages: pt_br

source: The sign string immediately succeeds the currency_symbol
pt_br: A string sinal sucede imediatamente o simbolo da moeda

source: The grouping fields contain arrays that define the way numbers should be grouped.
pt_br: Os campos de agrupamento contém matrizes que definem o modo de como os números seriam agrupados.

source: For example, the grouping field for the en_US locale, would contain a 2 item array with the values 3 and 3.
pt_br: Por exemplo, o campo de agrupamento para a localidade en_US, conteria uma matriz de 2 itens com os valores 3 e 3.

source: The higher the index in the array, the farther left the grouping is.
pt_br: O mais alto índice na matriz, mais distante da esquerda do agrupamento está.

source: If an array element is equal to CHAR_MAX, no further grouping is done.
pt_br: Se um elemento da matriz é igual a CHAR_MAX, até aqui nenhum agrupamento é feito.

source: If an array element is equal to 0, the previous element should be used.
pt_br: Se um elemento de matriz é igual a 0, o prévio elemento seria usado.

source: Example 1. localeconv() example
pt_br: Exemplo 1. localeconv() exemplo

source: The constant CHAR_MAX is also defined for the use mentioned above.
pt_br: A constante CHAR_MAX também está definida para o uso mencionado acima.

source: See also setlocale().
pt_br: Veja também setlocale().

source: The localtime() function returns an array identical to that of the structure returned by the C function call.
pt_br: A função localtime() retorna uma matriz idêntica àquela da estrutura retornada pela chamada de uma função em C.

source: The first argument to localtime() is the timestamp, if this is not given the current time is used.
pt_br: O primeiro argumento para localtime() é o timestamp, se este não é dado, a hora atual é usada.

source: The second argument to the localtime() is the is_associative, if this is set to 0 or not supplied than the array is returned as a regular, numerically indexed array.
pt_br: O segundo argumento para localtime() é o is_associative, se este é definido como 0 ou não fornecido então a matriz é retornada como uma matriz normal, matriz com indices numéricos.

source: If the argument is set to 1 then localtime() is an associative array containing all the different elements of the structure returned by the C function call to localtime.
pt_br: Se o argumento é definido como 1 então localtime() é uma matriz associativa contendo todos os diferentes elementos da estrutura retornados pela chamada da função C para o localtime.

source: The names of the different keys of the associative array are as follows:
pt_br: Os nomes das diferentes chaves da matriz associativa são as seguintes:

source: "tm_sec" - seconds
pt_br: "tm_sec" - segundos

source: "tm_min" - minutes
pt_br: "tm_min" - minutos

source: "tm_hour" - hour
pt_br: "tm_hour" - hora

source: "tm_mday" - day of the month
pt_br: "tm_mday" - dia do mês

source: "tm_mon" - month of the year, starting with 0 for January
pt_br: "tm_mon" - mês do ano, começa com 0 para Janeiro

source: "tm_year" - Years since 1900
pt_br: "tm_year" - Anos desde 1900

source: "tm_wday" - Day of the week
pt_br: "tm_wday" - Dia da semana

source: "tm_yday" - Day of the year
pt_br: "tm_yday" - Dia do ano

source: "tm_isdst" - Is daylight savings time in effect
pt_br: "tm_isdst" - Está em horário de verão

source: Returns the base-10 logarithm of arg.
pt_br: Retorna o logaritmo na base 10 de arg.

source: The base parameter became available with PHP version 4.3.0.
pt_br: Descrição

source: As always you can calculate the logarithm in base b of a number n, but using the mathematical identity: log b (n) = log(n) / log(b), where log is the neperian (or natural) logarithm.
pt_br: Retorna o logaritmo natural de arg.

source: Gathers the statistics of the file or symbolic link named by filename.
pt_br: Descrição

source: This function is identical to the stat() function except that if the filename parameter is a symbolic link, the status of the symbolic link is returned, not the status of the file pointed to by the symbolic link.
pt_br: Esta função é identica a stat() exceto que se o parametro nomedoarquivo é um link simbólico o status do link simbólico é retornado e não o status do arquivo apontando pelo link simbólico.

source: lstat() cannot be used on remote files.
pt_br: lstat() não pode ser utilizado em arquivos remotos.

source: The second parameter was added in PHP 4.1.0
pt_br: Nota:

source: This function returns a string with whitespace stripped from the beginning of str.
pt_br: O segundo parâmetro foi adicionado no PHP 4.1.0

source: Without the second parameter, ltrim() will strip these characters:
pt_br: Esta função retorna uma string com whitespace retirados do início de str.

source: "" (ASCII 32 (0x20)), an ordinary space.
pt_br: Sem o segundo parâmetro, ltrim() retirará estes caracters:

# " " (ASCII 9 (0x09)), a tab.
source: "\t" (ASCII 9 (0x09)), a tab.
pt_br: "" (ASCII 32 (0x20)), um espaço normal.

# " " (ASCII 10 (0x0A)), a new line (line feed).
source: "\n" (ASCII 10 (0x0A)), a new line (line feed).
pt_br: "\t" (ASCII 9 (0x09)), uma tabela.

source: "\x0B" (ASCII 11 (0x0B)), a vertical tab.
pt_br: "\0" (ASCII 0 (0x00)), O NUL -byte.

source: You can also specify the characters you want to strip, by means of the charlist You can also specify the characters you want to strip, by means of the charlist parameter.
pt_br: Você pode também especificar os caracteres que você quer retirar, por meio do parâmetro charlist.

source: Simply list all characters that you want to be stripped.
pt_br: Simplesmente lista todos os caracteres que você quer que sejam retirados.

source: With.. you can specify a range of characters.
pt_br: Com.. você pode especificar um ordem de caracteres.

source: Usage example of ltrim()
pt_br: Exemplo do uso de ltrim()

source: See also trim() and rtrim().
pt_br: Veja também trim() e rtrim().

source: mail() automatically mails the message specified in message to the receiver specified in to.
pt_br: mail() automaticamente envia a mensagem especificada em message para o destinatário especificado em to.

source: Multiple recipients can be specified by putting a comma between each address in to.
pt_br: Destinatários múltiplos podem podem ser especificados colocando uma vírgula entre cada endereço em to.

source: Email with attachments and special types of content can be sent using this function.
pt_br: Email com anexos e tipos de conteúdo especiais podem ser enviados usando esta função.

source: This is accomplished via MIME-encoding - for more information, see this Zend article or the PEAR Mime Classes.
pt_br: Esta é completada via MIME-encoding - para mais informações, veja Zend article or the PEAR Mime Classes.

source: The following RFC 's may also be useful:
pt_br: Os seguintes RFC 's pode ser úteis:

source: mail() returns TRUE if the mail was successfully accepted for delivery, FALSE otherwise.
pt_br: mail() retorna TRUE se o email enviado foi aceito para entrega, do contrário FALSE.

source: The Windows implementation of mail() differs in many ways from the Unix implementation.
pt_br: A implentação do Windows de mail() difere bastante da implentação Unix.

source: First, it doesn' t use a local binary for composing messages but only operates on direct sockets which means a MTA is needed listening on a network socket (which can either on the localhost or a remote machine).
pt_br: Primeiro, ele não usa um binary local para compor mensagens mas apenas opera com sockets diretos o que significa que uma MTA é necessária prestando atenção num socket de rede (que pode ser ou o localhost ou uma máquina remota).

source: Second, the custom headers like From:, Cc:, Bcc: and Date: are not interpreted by the MTA in the first place, but are parsed by PHP.
pt_br: Segundo, os cabeçalhos personalizados como From:, Cc:, Bcc: e Date: são not interpretados por MTA em primeiro lugar, mas são analizados pelo PHP.

source: PHP 4.3 only supported the Cc: header element (and was case-sensitive).
pt_br: PHP 4.3 somente elementos suportados Cc: elemento de cabeçalho (e foi caso-sensitivo).

source: PHP = 4.3 supports all the mentioned header elements and is no longer case-sensitive.
pt_br: PHP = 4.3 suporta todos os elementos de cabeçalho suportados e não distante caso-sensitivo.

source: Sending mail.
pt_br: Enviando email.

source: If a fourth string argument is passed, this string is inserted at the end of the header.
pt_br: Se uma string como quarto argumento é passada, esta string é insrida no fim do cabeçalho.

source: This is typically used to add extra headers.
pt_br: É usado tipicamente para adicionar cabeçalhos extras.

source: Multiple extra headers are separated with a carriage return and newline.
pt_br: Cabeçalhos extras múltiplos são separados com sinal de retorno e novalinha.

source: You must use \r\n to separate headers, although some Unix mail transfer agents may work with just a single newline (\n).
pt_br: Você deve utilizar \r\n para separar headers, embora alguns agentes de transferência de email Unix mail podem trabalhar com uma simples linha somente (\n).

source: Sending mail with extra headers.
pt_br: Enviando email com cabeçalhos extras.

source: The additional_parameters parameter can be used to pass an additional parameter to the program configured to use when sending mail using the sendmail_path The additional_parameters parameter can be used to pass an additional parameter to the program configured to use when sending mail using the sendmail_path configuration setting.
pt_br: Por exemplo, isto pode ser usado para definir o endereço do envelope remetente quando usar sendmail.

source: You may need to add the user that your web server runs as to your sendmail configuration to prevent a 'X-Warning' header from being added to the message when you set the envelope sender using this method.
pt_br: Você pode precisar adicionar o usuário que seu servidor web executa como para sua configuração de sendmail para evitar que um cabeçalho 'X-Warning' seja adicionado á mensagem quando você define o envelope remetente usando este método.

source: Sending mail with extra headers and setting an additional command line parameter.
pt_br: Enviando email com cabeçalhos extras e definindo um parâmetro de uma linha de comando adicional.

source: This fifth parameter was added in PHP 4.0.5.
pt_br: O quinto parâmetro foi adicionado no PHP 4.0.5.

source: You can also use simple string building techniques to build complex email messages.
pt_br: Você pode utilizar strings simples utilizando técnicas para construir mensagens complexas.

source: Example 4.
pt_br: Exemplo 4.

source: Sending complex email.
pt_br: Enviando email complexo.

source: 1.0\r\n"; $headers .= "Content-type: text / html; charset=iso-8859-1\r\n"; / * additional headers * / $headers .= "From:
pt_br: /* recipients * / $to = "Mary mary@example.com". ","; / /note the comma $to .= "Kelly kelly@example.com "; / * subject * / $subject = "Birthday Reminders for August"; / * message * / $message = 'html head title Birthday Reminders for August / title / head body p Here are the birthdays upcoming in August! / p table tr th Person / th th Day / th th Month / th th Year / th / tr tr td Joe / td td 3rd / td td August / td td 1970 / td / tr tr td Sally / td td 17th / td td August / td td 1973 / td / tr / table / body / html'; / * To send HTML mail, you can set the Content-type header. * / $headers = "MIME-Version:

source: The to The to parameter cannot be an address in the form of "Something someone@example.com".
pt_br: Nota:

source: See also imap_mail().
pt_br: Certifique-se que você não tem nenhum caractere novalinha em to ou subject, ou o email não será enviado corretamente.

source: (4.1.0 - 4.1.2 only)
pt_br: mailparse_determine_best_xfer_encoding

source: Mathematical Functions
pt_br: Matemática e Trigonometria

source: max() returns the numerically highest of the parameter values.
pt_br: Descrição

source: If the first parameter is an array, max() returns the highest value in that array.
pt_br: max() retorna o maior número dos parâmetros.

source: If one or more of the values is a float, all the values will be treated as floats, and a float is returned.
pt_br: Se o primeiro parâmetro é um array, max() retorna o maior valor do array.

source: If none of the values is a float, all of them will be treated as integers, and an integer is returned.
pt_br: Você pode comparar uma quantidade ilimitada de números.

source: See also min().
pt_br: Se nenhum dos valores for float, todos serão tratados como inteiros, e um inteiro é retornado.

source: Example 1. mb_convert_case() example
pt_br: Exemplo 1. mb_convert_case() example

source: Example 1. mb_convert_encoding() example
pt_br: Exemplo 1. mb_convert_encoding() example

source: Example 1. mb_convert_kana() example
pt_br: Exemplo 1. mb_convert_kana() example

source: Example 1. mb_convert_variables() example
pt_br: Exemplo 1. mb_convert_variables() example

source: Example 1. convmap example
pt_br: Exemplo 1. convmap example

source: Example 1. mb_detect_encoding() example
pt_br: Exemplo 1. mb_detect_encoding() example

source: Example 2. mb_detect_order() examples
pt_br: Exemplo 2. mb_detect_order() examples

source: Example 2. mb_encode_numericentity() example
pt_br: Exemplo 2. mb_encode_numericentity() example

source: (4.2.0 - 4.3.0 only)
pt_br: mb_ereg

source: Example 1. mb_internal_encoding() example
pt_br: Exemplo 1. mb_internal_encoding() example

source: mb_language() sets language.
pt_br: Description

source: Example 1. mb_output_handler() example
pt_br: Exemplo 1. mb_output_handler() example

source: Example 1. mb_preferred_mime_string() example
pt_br: Exemplo 1. mb_preferred_mime_string() example

source: (PHP 4 4.3.0 only)
pt_br: mb_regex_set_options

source: mb_send_mail() sends email.
pt_br: Description

source: Example 1. mb_strimwidth() example
pt_br: Exemplo 1. mb_strimwidth() example

source: Example 1. mb_strtolower() example
pt_br: Exemplo 1. mb_strtolower() example

source: Example 1. mb_strtoupper() example
pt_br: Exemplo 1. mb_strtoupper() example

source: mb_strwidth() returns width of string str.
pt_br: Description

source: Example 1. mb_substitute_character() example
pt_br: Exemplo 1. mb_substitute_character() example

source: Example 1. mb_substr_count() example
pt_br: Exemplo 1. mb_substr_count() example

source: Returns an MCAL stream on success, FALSE on error.
pt_br: Description

source: Reopens an MCAL stream to a new calendar.
pt_br: Description

source: mcrypt_create_iv() is used to create an IV.
pt_br: Description

source: Example 1. mcrypt_create_iv() example
pt_br: Exemplo 1. mcrypt_create_iv() example

source: This function returns the name of the algorithm.
pt_br: Description

source: ?php $td = mcrypt_module_open (MCRYPT_CAST_256, '', MCRYPT_MODE_CFB, ''); echo mcrypt_enc_get_algorithms_name($td). "\n"; $td = mcrypt_module_open ('cast-256','', MCRYPT_MODE_CFB, ''); echo mcrypt_enc_get_algorithms_name($td). "\n";?
pt_br: Exemplo 1. mcrypt_enc_get_algorithms_name() example

source: This function returns the name of the mode.
pt_br: Description

source: ?php $td = mcrypt_module_open (MCRYPT_CAST_256, '', MCRYPT_MODE_CFB, ''); echo mcrypt_enc_get_modes_name($td). "\n"; $td = mcrypt_module_open ('cast-256','', 'ecb', ''); echo mcrypt_enc_get_modes_name($td). "\n";?
pt_br: Exemplo 1. mcrypt_enc_get_modes_name() example

source: Example 1. mcrypt_enc_get_supported_key_sizes() example
pt_br: Exemplo 1. mcrypt_enc_get_supported_key_sizes() example

source: Example 1. mcrypt_encrypt() Example
pt_br: Exemplo 1. mcrypt_encrypt() Example

source: This function encrypts data.
pt_br: Description

source: Example 1. mcrypt_get_block_size() example
pt_br: Exemplo 1. mcrypt_get_block_size() example

source: mcrypt_get_cipher_name() is used to get the name of the specified cipher.
pt_br: Description

source: Example 1. mcrypt_get_cipher_name() Example
pt_br: Exemplo 1. mcrypt_get_cipher_name() Example

source: Example 1. mcrypt_list_algorithms() Example
pt_br: Exemplo 1. mcrypt_list_algorithms() Example

source: Example 1. mcrypt_list_modes() Example
pt_br: Exemplo 1. mcrypt_list_modes() Example

source: Example 1. mcrypt_module_open() Example
pt_br: Exemplo 1. mcrypt_module_open() Example

source: This function runs the self test on the algorithm specified.
pt_br: Description

source: Mhash Functions
pt_br: Mhash - Funções de hash

source: Calculates the MD5 hash of the specified filename using the RSA Data Security, Inc. MD5 Message-Digest Algorithm
pt_br: Calcula o hash MD5 de um filename especificado usando o RSA Data Security, Inc. MD5 Message-Digest Algorithm

source: This function has the same purpose of the command line utility md5sum.
pt_br: Esta função tem o mesmo propósito da linha de comando md5sum.

source: See also md5() and crc32()
pt_br: Veja também md5() e crc32()

source: Calculates the MD5 hash of str using the RSA Data Security, Inc. MD5 Message-Digest Algorithm
pt_br: Calcula o hash MD5 de str usando o RSA Data Security, Inc. MD5 Message-Digest Algorithm

source: The hash is a 32-character hexadecimal number.
pt_br: O hash é um número hexadecimal caracter-32.

source: See also crc32(), md5_file(), and sha1().
pt_br: Veja também crc32() e md5_file()

source: This function decrypts data.
pt_br: Description

source: Example 1. mdecrypt_generic() Example
pt_br: Exemplo 1. mdecrypt_generic() Example

source: Calculates the metaphone key of str.
pt_br: Descrição

source: Similar to soundex() metaphone creates the same key for similar sounding words.
pt_br: Similar a soundex() metaphone cria a mesma key para palavras sonoras similares.

source: It' s more accurate than soundex() It's more accurate than soundex() as it knows the basic rules of English pronunciation.
pt_br: Ela é mais precisa do que soundex() por ela conhecer as regras básicas da pronunciação inglesa.

source: The metaphone generated keys are of variable length.
pt_br: As metaphone keys geradas são de comprimentos variados.

source: Metaphone was developed by Lawrence Philips lphilips@verity.com.
pt_br: Metaphone foi desenvolvido por Lawrence Philips lphilips@verity.com.

source: It is described in ["Practical Algorithms for Programmers", Binstock Rex, Addison Wesley, 1995].
pt_br: Ela é descrita em ["Practical Algorithms for Programmers", Binstock Rex, Addison Wesley, 1995].

source: This function returns TRUE if the method given by method_name has been defined for the given object, FALSE otherwise.
pt_br: Esta função retorma TRUE se o método dado pelo method_name foi definido para o dado object, caso contrário FALSE.

source: mhash_count() returns the highest available hash id.
pt_br: mhash_count() retorna a mais alta hash id disponível.

source: Hashes are numbered from 0 to this hash id.
pt_br: As hashes são numeradas de 0 até esta hash id.

source: Traversing all hashes
pt_br: Listando todas as hashes

source: ?php $nr = mhash_count(); for ($i = 0; $i = $nr; $i++) {echo sprintf ("The blocksize of %s is %d\n", mhash_get_hash_name ($i), mhash_get_block_size ($i));}?
pt_br: ?php $nr = mhash_count(); for ($i = 0; $i = $nr; $i++) {echo sprintf ("O tamanho do bloco de %s é %d\n", mhash_get_hash_name ($i), mhash_get_block_size ($i));}?

source: mhash_get_block_size() is used to get the size of a block of the specified hash.
pt_br: mhash_get_block_size() é usada para obter o tamanho de um blobo da hash específicada.

source: mhash_get_block_size() takes one argument, the hash and returns the size in bytes or FALSE, if the hash does not exist.
pt_br: mhash_get_block_size() recebe um argumento, a hash e retorna o tamanho em bytes ou FALSE, se o parametro hash não existe.

source: mhash_get_hash_name() is used to get the name of the specified hash.
pt_br: Descrição

source: mhash_get_hash_name() takes the hash id as an argument and returns the name of the hash or FALSE, if the hash does not exist.
pt_br: mhash_get_hash_name() recebe a id da hash como um argumento e retorna o nome da hash ou FALSE, se a hash não existe.

source: Example 1. mhash_get_hash_name() example
pt_br: Exemplo do mhash_get_hash_name()

source: The above example will print out:
pt_br: O exemplo acima irá imprimir:

source: mhash() applies a hash function specified by hash to the data and returns the resulting hash (also called digest).
pt_br: mhash() applica a função hash especificada por hash para o parametro data e retorna a hash resultante (também chamada de digest).

source: If the key is specified it will return the resulting HMAC.
pt_br: Se a key for especificada a função irá retornar o HMAC resultante.

source: HMAC is keyed hashing for message authentication, or simply a message digest that depends on the specified key.
pt_br: HMAC é o hashing com chave (keyed) para autenticações de mensagens, ou simplesmente um digest de mensagens que depende na chave (key) específicada.

source: Not all algorithms supported in mhash can be used in HMAC mode.
pt_br: Nem todos os algorítmos suportados em mhash podem ser usados em modo HMAC.

source: In case of an error returns FALSE.
pt_br: Em caso de erro retorna FALSE.

source: That salt must be known when you check the keys, thus it is a good idea to append the key to it.
pt_br: Descrição

source: Keep in mind that user supplied passwords are not really suitable to be used as keys in cryptographic algorithms, since users normally choose keys they can write on keyboard.
pt_br: Este é o algoritmo Salted S2K como especificado no documento OpenPGP (RFC 2440).

source: These passwords use only 6 to 7 bits per character (or less).
pt_br: Este salt tem que ser sabido quando você checar as suas chaves (keys), logo é uma boa ideia que a chave siga o salt.

source: It is highly recommended to use some kind of tranformation (like this function) to the user supplied key.
pt_br: Tenha em mente que as senhas fornecidas pelos usuários não são boas para serem usadas como chaves em algoritmos criptográficos, pois usuários normalmente escolhem chaves que eles podem escrever no teclado.

source: Returns the string "msec sec" where sec is the current time measured in the number of seconds since the Unix Epoch (0:00:00 January 1, 1970 GMT), and msec is the microseconds part.
pt_br: Retorna uma string "msec sec" onde sec é o tempo atual medido no número de segundos desde a Era Unix (0:00:00 January 1, 1970 GMT), e msec é a parte em microsegundos.

source: This function is only available on operating systems that support the gettimeofday() system call.
pt_br: Esta função está disponível unicamente em sistemas operacionais que suportam a chamada gettimeofday().

source: Both portions of the string are returned in units of seconds.
pt_br: Ambas porções de string são retornadas em segundos.

source: Example 1. microtime() example
pt_br: Exemplo 1. microtime() exemplo

source: See also time().
pt_br: Veja também time().

source: Microsoft SQL Server functions
pt_br: Funções Microsoft SQL Server

source: min() returns the numerically lowest of the parameter values.
pt_br: min() retorna o menor número dos parâmetros.

source: In the first variant, you need at least two parameters and min() returns the lowest of these values.
pt_br: Na primeira variante, você precisa pelo menos dois parâmetros, e min() retornará o menor desses valores.

source: You can compare an unlimited number of values.
pt_br: Você pode comparar um número ilimitado de valores.

source: If one of the variables is undefined, min() will fail.
pt_br: Se uma das variáveis é indefinida, min() falhará.

source: In the second variant, min() returns the lowest value in numbers.
pt_br: Na segunda variante, min() retorna o menor dos valores em numbers.
